## 계층적 인덱싱

Pandas는 고차원의 데이터를 처리하는 객체를 제공하지만 주로 단일 인덱스 내에 여러 인덱스 레벨을 포함하는 계층적 인덱싱(hierarchical indexing, 다중 인덱싱(multi-indexing))을 활용한다. 이 방식으로 고차원 데이터를 익숙한 1차원 Series와 2차원 DataFrame 객체로 간결하게 표현할 수 있다.

### 다중 인덱스된 Series

다음과 같은 2차원의 데이터프레임이 있다. 이것을 1차원의 시리즈로 표현한다면?

In [80]:
import pandas as pd
import numpy as np

In [81]:
pop = pd.DataFrame([{"2000" : 33871648, "2010" : 37253956}, 
                    {"2000" : 18976457, "2010" : 19378102},
                    {"2000" : 20851820, "2010" : 25145561}], 
                   index=['California', 'New York','Taxas'])

In [82]:
pop

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Taxas       20851820  25145561

In [83]:
index = [('California', 2000), ('California', 2010),
        ('New York', 2000), ('New York', 2010),
        ('Taxas', 2000), ('Taxas', 2010)]

In [84]:
index

[('California', 2000),
 ('California', 2010),
 ('New York', 2000),
 ('New York', 2010),
 ('Taxas', 2000),
 ('Taxas', 2010)]

In [85]:
population = [33871648, 37253956, 18976457, 19378102, 20851820, 25145561]

In [86]:
pop2 = pd.Series(population, index=index)

In [87]:
pop2

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Taxas, 2000)         20851820
(Taxas, 2010)         25145561
dtype: int64

In [88]:
pop2[[i for i in pop2.index if i[1] == 2000]]

(California, 2000)    33871648
(New York, 2000)      18976457
(Taxas, 2000)         20851820
dtype: int64

### Pandas MultiIndex

Pandas는 MultiIndex를 활용하여 다중 레벨의 인덱스를 만들 수 있다.

In [89]:
index

[('California', 2000),
 ('California', 2010),
 ('New York', 2000),
 ('New York', 2010),
 ('Taxas', 2000),
 ('Taxas', 2010)]

In [90]:
# A = pd.DataFrame(rng.randint(0,20,(2,2)), columns=list('AB'))
index2 = pd.MultiIndex.from_tuples(index)
index2

MultiIndex(levels=[['California', 'New York', 'Taxas'], [2000, 2010]],
           codes=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

새로 구성한 인덱스를 적용할 때 reindex() 매서드를 활용

In [91]:
pop3 = pop2.reindex(index2)

In [92]:
pop3

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Taxas       2000    20851820
            2010    25145561
dtype: int64

In [93]:
pop2

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Taxas, 2000)         20851820
(Taxas, 2010)         25145561
dtype: int64

In [94]:
pop3[:, 2010]

California    37253956
New York      19378102
Taxas         25145561
dtype: int64

unstack() 함수는 다중 인덱스를 가진 Series를 전형적인 인덱스의 DataFrame으로 빠르게 변환해 준다. stack() 함수는 반대 연산을 제공한다.

In [95]:
pop4 = pop3.unstack()

In [96]:
pop4

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Taxas       20851820  25145561

In [97]:
pop5 = pop4.stack()

In [98]:
pop5

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Taxas       2000    20851820
            2010    25145561
dtype: int64

다중인덱스 방식으로 레벨을 구성함으로써 데이터 구조에 유연성을 제공할 수 있다.

In [99]:
pop_df = pd.DataFrame({'total': pop5,
                      'under18' : [9267089, 9284094,
                                  4687374, 4318033,
                                  5906301, 6879014]})

In [100]:
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Taxas      2000  20851820  5906301
           2010  25145561  6879014

In [101]:
f_u18 = pop_df['under18'] / pop_df['total']

In [102]:
f_u18

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Taxas       2000    0.283251
            2010    0.273568
dtype: float64

##### Quiz
멀티 인덱스를 만들어 보자

In [103]:
quiz = pd.DataFrame([{1,11},{5,1}],columns=list("AB"))

In [104]:
quiz

   A   B
0  1  11
1  1   5

In [105]:
# quiz.stack()

In [106]:
quiz

   A   B
0  1  11
1  1   5

In [107]:
my_index = [(0,'A'), (0,'B'), (1,'A'), (1,'B')]

In [108]:
my_index

[(0, 'A'), (0, 'B'), (1, 'A'), (1, 'B')]

In [109]:
my_index2 = pd.MultiIndex.from_tuples(my_index)

In [110]:
my_index2

MultiIndex(levels=[[0, 1], ['A', 'B']],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

### MultiIndex 생성 메서드

다중인덱스를 생성하는 가장 간편한 방식은 2개 이상의 인덱스 배열 리스트를 전달하는 것

In [111]:
df = pd.DataFrame(np.random.rand(4,2),
                 index=[['a','a','b','b'],[1,2,1,2]],
                 columns=['data1','data2'])

In [112]:
df

        data1     data2
a 1  0.673409  0.991188
  2  0.878231  0.611009
b 1  0.342055  0.956525
  2  0.788706  0.959526

### 명시적 MultiIndex 생성자

In [113]:
pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]]) # 배열

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [114]:
pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2)]) # 튜플

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [115]:
pd.MultiIndex.from_product([['a','b'],[1,2]]) # 데카르트 곱

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [116]:
pd.MultiIndex(levels=[['a','b'],[1,2]], labels=[[0,0,1,1],[0,1,0,1]])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: the 'labels' keyword is deprecated, use 'codes' instead
  """Entry point for launching an IPython kernel.

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

### MultiIndex 레벨 이름


MultiIndex의 레벨에 이름을 지정할 수 있다. MultiIndex 생성자에 names 인수를 전달하거나 생성 후에 인덱스의 names 속성을 성정해 이름을 지정 가능

In [117]:
pop5

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Taxas       2000    20851820
            2010    25145561
dtype: int64

In [118]:
pop5.index.names = ['state','year']
pop5

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Taxas       2000    20851820
            2010    25145561
dtype: int64

In [128]:
index = pd.MultiIndex.from_product([[2013,2014],[1,2]], 
                                   names=['year','visit'])

In [129]:
columns = pd.MultiIndex.from_product([
    ['Bob','Guido','Sue'],['HR','Temp']], 
    names=['subject', 'type'])

In [130]:
# 임의의 데이터 만드는 과정
data = np.round(np.random.randn(4,6),1)
data[:, ::2] *= 10
data += 37

In [126]:
health_data = pd.DataFrame(data, index=index, columns=columns)

In [127]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      33.0  35.7  46.0  35.8  52.0  38.1
     2      40.0  37.2  48.0  39.5  47.0  35.8
2014 1      51.0  35.0  33.0  37.3  57.0  37.3
     2      31.0  37.8  26.0  36.7  45.0  35.9

##### quiz

In [ ]:
다음과 같은 다중 인덱스를 행과 열로 가진 데이터 프레임을 만드세요.

In [134]:
# 데이터 로드
law = np.load('./quiz3.npy')
law

array([[1120., 2120., 4320., 1620.],
       [ 720., 2320., 1920., 1620.],
       [1320., 3320., 1920., 1120.],
       [ 720.,  320., 1920., 7620.],
       [2120.,  920., 1320.,  620.],
       [1620.,  920., 5220., 1620.],
       [1320., 1120., 5520., 7620.],
       [1220., 2920.,  420., 3620.]])

In [135]:
index = pd.MultiIndex.from_product([
    ["Brown Stone", "North", "Central", "South"],
    ["Condominium", "House"]],
    names=['area', 'type'])

In [136]:
index

MultiIndex(levels=[['Brown Stone', 'Central', 'North', 'South'], ['Condominium', 'House']],
           codes=[[0, 0, 2, 2, 1, 1, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['area', 'type'])

In [137]:
columns = pd.MultiIndex.from_product(
[[2017, 2018],['전반기','후반기']],
names=['year', 'Quarter'])

In [138]:
columns

MultiIndex(levels=[[2017, 2018], ['전반기', '후반기']],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['year', 'Quarter'])

In [139]:
index

MultiIndex(levels=[['Brown Stone', 'Central', 'North', 'South'], ['Condominium', 'House']],
           codes=[[0, 0, 2, 2, 1, 1, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['area', 'type'])

In [141]:
estate = pd.DataFrame(law, index=index, 
                      columns=columns)

In [142]:
estate

year                       2017            2018
Quarter                     전반기     후반기     전반기     후반기
area        type
Brown Stone Condominium  1120.0  2120.0  4320.0  1620.0
            House         720.0  2320.0  1920.0  1620.0
North       Condominium  1320.0  3320.0  1920.0  1120.0
            House         720.0   320.0  1920.0  7620.0
Central     Condominium  2120.0   920.0  1320.0   620.0
            House        1620.0   920.0  5220.0  1620.0
South       Condominium  1320.0  1120.0  5520.0  7620.0
            House        1220.0  2920.0   420.0  3620.0

### MultiIndex 인덱싱 및 슬라이싱

#### 시리즈에서 인덱싱 및 슬라이싱

In [145]:
pop5

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Taxas       2000    20851820
            2010    25145561
dtype: int64

In [146]:
pop5['California']

year
2000    33871648
2010    37253956
dtype: int64

In [147]:
pop5['California', 2010]

37253956

MultiIndex가 정렬되어 있다면 부분 슬라이싱도 가능하다.

In [148]:
pop5.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [149]:
pop5[:, 2000]

state
California    33871648
New York      18976457
Taxas         20851820
dtype: int64

In [150]:
pop5[pop5 > 22000000]

state       year
California  2000    33871648
            2010    37253956
Taxas       2010    25145561
dtype: int64

In [151]:
pop5[['California', 'Taxas']]

state       year
California  2000    33871648
            2010    37253956
Taxas       2000    20851820
            2010    25145561
dtype: int64

### 데이터 프레임에서 인덱싱 및 슬라이싱

In [152]:
estate

year                       2017            2018
Quarter                     전반기     후반기     전반기     후반기
area        type
Brown Stone Condominium  1120.0  2120.0  4320.0  1620.0
            House         720.0  2320.0  1920.0  1620.0
North       Condominium  1320.0  3320.0  1920.0  1120.0
            House         720.0   320.0  1920.0  7620.0
Central     Condominium  2120.0   920.0  1320.0   620.0
            House        1620.0   920.0  5220.0  1620.0
South       Condominium  1320.0  1120.0  5520.0  7620.0
            House        1220.0  2920.0   420.0  3620.0

In [155]:
estate[2017,'전반기']

area         type
Brown Stone  Condominium    1120.0
             House           720.0
North        Condominium    1320.0
             House           720.0
Central      Condominium    2120.0
             House          1620.0
South        Condominium    1320.0
             House          1220.0
Name: (2017, 전반기), dtype: float64

#### 배열 슬라이싱

numpy의 슬라이싱은 표준 파이썬 구문에 따르지만, 시작인덱스에서 마지막 인덱스까지 일정 간격을 두어 띄여서 값을 슬라이스 할 수 있다.

배열이름[시작인덱스:마지막인덱스:간격]

시작인덱스, 마지막 인덱스, 간격을 설정하지 않으면 기본적으로는 0, 데이터 갯수, 1로 설정된다.

In [158]:
estate[0:7:2] # estate[::2]

year                       2017            2018
Quarter                     전반기     후반기     전반기     후반기
area        type
Brown Stone Condominium  1120.0  2120.0  4320.0  1620.0
North       Condominium  1320.0  3320.0  1920.0  1120.0
Central     Condominium  2120.0   920.0  1320.0   620.0
South       Condominium  1320.0  1120.0  5520.0  7620.0

In [160]:
estate.iloc[:5,:2] 
# iloc인덱서 파이썬이 자동으로 지정한 인덱스 활용
# iloc[행인덱스 열인덱스]

year                       2017
Quarter                     전반기     후반기
area        type
Brown Stone Condominium  1120.0  2120.0
            House         720.0  2320.0
North       Condominium  1320.0  3320.0
            House         720.0   320.0
Central     Condominium  2120.0   920.0

In [161]:
estate.loc[:, (2018, '전반기')]
# loc 인덱서는 슬라이싱할 때 dataframe에 명시한 index로 기준을 삼는다.
# loc[행, 열]

area         type
Brown Stone  Condominium    4320.0
             House          1920.0
North        Condominium    1920.0
             House          1920.0
Central      Condominium    1320.0
             House          5220.0
South        Condominium    5520.0
             House           420.0
Name: (2018, 전반기), dtype: float64

IndexSlice 객체로 튜플로 슬라이스하여 가져오면 
에러가 발생되는 문제를 해결할 수 있다.

In [163]:
idx = pd.IndexSlice
estate.loc[idx[:, "Condominium"], idx[:,'전반기']]

year                       2017    2018
Quarter                     전반기     전반기
area        type
Brown Stone Condominium  1120.0  4320.0
North       Condominium  1320.0  1920.0
Central     Condominium  2120.0  1320.0
South       Condominium  1320.0  5520.0

##### Quiz
다음의 estate 데이터 프레임을 다음과 같이 슬라이스 하시오

In [165]:
estate

year                       2017            2018
Quarter                     전반기     후반기     전반기     후반기
area        type
Brown Stone Condominium  1120.0  2120.0  4320.0  1620.0
            House         720.0  2320.0  1920.0  1620.0
North       Condominium  1320.0  3320.0  1920.0  1120.0
            House         720.0   320.0  1920.0  7620.0
Central     Condominium  2120.0   920.0  1320.0   620.0
            House        1620.0   920.0  5220.0  1620.0
South       Condominium  1320.0  1120.0  5520.0  7620.0
            House        1220.0  2920.0   420.0  3620.0

In [166]:
estate.iloc[1:8:2]

year                 2017            2018
Quarter               전반기     후반기     전반기     후반기
area        type
Brown Stone House   720.0  2320.0  1920.0  1620.0
North       House   720.0   320.0  1920.0  7620.0
Central     House  1620.0   920.0  5220.0  1620.0
South       House  1220.0  2920.0   420.0  3620.0

In [167]:
estate.iloc[1:8:2, 2:4:1]

year                 2018
Quarter               전반기     후반기
area        type
Brown Stone House  1920.0  1620.0
North       House  1920.0  7620.0
Central     House  5220.0  1620.0
South       House   420.0  3620.0

In [168]:
idx = pd.IndexSlice

In [170]:
estate.loc[idx[:, 'House'], idx[2018, :]]

year                 2018
Quarter               전반기     후반기
area        type
Brown Stone House  1920.0  1620.0
North       House  1920.0  7620.0
Central     House  5220.0  1620.0
South       House   420.0  3620.0

### 다중 인덱스 재정렬하기

다중 인덱스 슬라이싱 연산은 인덱스가 정렬되어 있어야 가능하다

#### 정렬된 인덱스와 정렬되지 않은 인덱스

In [173]:
index = pd.MultiIndex.from_product([['a','c','b'],[1,2]])

In [174]:
data = pd.Series(np.random.rand(6), index=index)

In [175]:
data.index.names = ['char','int']

In [176]:
data

char  int
a     1      0.507639
      2      0.742455
c     1      0.019371
      2      0.918289
b     1      0.132383
      2      0.808825
dtype: float64

In [178]:
try:
    data['a':'b']
except Exception as e:
    print(e)

'Key length (1) was greater than MultiIndex lexsort depth (0)'

sort_index() 메서드로 멀티 인덱스를 정렬할 수 있다

In [179]:
data = data.sort_index()

In [180]:
data

char  int
a     1      0.507639
      2      0.742455
b     1      0.132383
      2      0.808825
c     1      0.019371
      2      0.918289
dtype: float64

In [181]:
data['a':'b']

char  int
a     1      0.507639
      2      0.742455
b     1      0.132383
      2      0.808825
dtype: float64

### 인덱스 설정 및 재설정

인덱스를 열로 설정하여 데이터를 재정렬할 수도 있다. reset_index() 메서드를 활용하면 인덱스의 정보가 열로 변환된다.

In [183]:
index = pd.MultiIndex.from_product([['California','New York','Texas'],[2000,2010]], names=["state","year"])

In [184]:
pop = pd.DataFrame([33871648,37253956,
                    18976457,19378192,
                    20851820,25145561], 
                   index=index, columns=['population'])

In [185]:
pop

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378192
Texas      2000    20851820
           2010    25145561


MultiIndex를 데이터프레임의 열로 만드는 reset_index()

In [188]:
pop_flat = pop.reset_index()
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378192
4       Texas  2000    20851820
5       Texas  2010    25145561

열값으로 MultiIndex를 만드는 set_index()

In [189]:
pop_flat.set_index(['state','year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378192
Texas      2000    20851820
           2010    25145561

### 다중 인덱스에서 데이터 집계

다중인덱스가 적용되어 있는 데이터테이블도 mean(), sum(), max() 같은 집계 메소드를 활용할 수 있다. 원하는 열이나 행을 level 매개변수로 전달

In [191]:
estate

year                       2017            2018
Quarter                     전반기     후반기     전반기     후반기
area        type
Brown Stone Condominium  1120.0  2120.0  4320.0  1620.0
            House         720.0  2320.0  1920.0  1620.0
North       Condominium  1320.0  3320.0  1920.0  1120.0
            House         720.0   320.0  1920.0  7620.0
Central     Condominium  2120.0   920.0  1320.0   620.0
            House        1620.0   920.0  5220.0  1620.0
South       Condominium  1320.0  1120.0  5520.0  7620.0
            House        1220.0  2920.0   420.0  3620.0

In [192]:
data_mean = estate.mean(level='type')

In [193]:
data_mean

year           2017            2018
Quarter         전반기     후반기     전반기     후반기
type
Condominium  1470.0  1870.0  3270.0  2745.0
House        1070.0  1620.0  2370.0  3620.0

In [195]:
data_sum=estate.sum(axis=1, level='year')
data_sum

year                       2017     2018
area        type
Brown Stone Condominium  3240.0   5940.0
            House        3040.0   3540.0
North       Condominium  4640.0   3040.0
            House        1040.0   9540.0
Central     Condominium  3040.0   1940.0
            House        2540.0   6840.0
South       Condominium  2440.0  13140.0
            House        4140.0   4040.0

##### Quiz
위의 데이터 프레임에서 년도 별로 값의 평균을 구하세요.